const { PrismaClient } = require('@prisma/client')
const prisma = new PrismaClient()

async function seed() {
    await prisma.pet.createMany({
        data: [
            {
                name: "Рекс",
                species: "Німецька вівчарка",
                age: "2 роки",
                gender: "Хлопчик",
                desc: "Розумний і вихований пес, знає багато команд, потребує високого фізичного і розумового навантаження, навчений захисту території.",
                imageUrl: "michael-dziedzic-si06cFB0g1s-unsplash (1).jpg",
                isFeatured: true,
                catSlug: "Собаки"
            },
            {
                name: "Міа",
                species: "Безпородна",
                age: "5 місяців",
                gender: "Дівчинка",
                desc: "Активна й грайлива кішка, любить увагу, невибаглива у харчуванні. Розпізнає своє ім'я і приходить на поклик. Любить досліджувати нові місця.",
                imageUrl: "onur-binay-E18nZ_OHh04-unsplash.jpg",
                isFeatured: true,
                catSlug: "Коти"
            },
            {
                name: "Жорік",
                species: "Сирійський хом'як",
                age: "8 місяців",
                gender: "Самець",
                desc: "Популярний вид домашніх гризунів, відомий своєю милою зовнішністю та відносною легкістю у догляді. Родом з напівпустельних районів Сирії та Туреччини. Харчуються зерновими сумішами, овочами, фруктами і спеціальними кормами для хом'яків. Загалом дружелюбні, але можуть бути територіальними і не люблять жити з іншими хом'яками.",
                imageUrl: "denis-bayer-4KC4hUWCtJI-unsplash.jpg",
                isFeatured: true,
                catSlug: "Гризуни"
            },
            {
                name: "Кікі",
                species: "Білий какаду",
                age: "8 років",
                gender: "Самка",
                desc: "Утримуються як домашні птахи в клітках або в вольєрах з достатньою кількістю місця для політів та руху. Їдять різноманітну їжу, включаючи фрукти, овочі, горіхи, зерно та комах. Ці птахи відомі своєю дружелюбністю та любов'ю до взаємодії з людьми. Вони також дуже розумні та вміють вчитися широкому спектру команд та трюків.",
                imageUrl: "jeffrey-hamilton-RiwD4u3HzcI-unsplash.jpg",
                isFeatured: true,
                catSlug: "Птахи"
            },
            {
                name: "Мідорі",
                species: "Зелена ігуана",
                age: "2 роки",
                gender: "Самка",
                desc: "Дорослі зелені ігуани можуть досягати довжини від 1,5 до 2 метрів, включаючи хвіст. Живуть у тропічних лісах Центральної і Південної Америки, переважно на деревах біля води. Рослиноїдні, харчуються листям, фруктами і овочами. З часом можуть стати досить ручними, але потребують терпіння і регулярного контакту.",
                imageUrl: "alex-williams-CxayZniisNA-unsplash.jpg",
                isFeatured: true,
                catSlug: "Рептилії"
            },
            {
                name: "Джинні",
                species: "Вогняна саламандра",
                age: "1 рік",
                gender: "Самка",
                desc: "Більшість видів вогняних саламандр поширені у вологих лісах та гірських регіонах Північної Америки, Європи та Азії. Утримуються в тераріумах з достатньою кількістю вологи та природної рослинності. Вогняні саламандри є захоплюючими тваринами для тих, хто має досвід у догляді за земноводними та може забезпечити їм необхідні умови. Також важливо пам'ятати про їх отруйність і дотримуватися обережних заходів безпеки.",
                imageUrl: "zdenek-machacek-U7pickyudCw-unsplash.jpg",
                isFeatured: true,
                catSlug: "Амфібії"
            },
            {
                name: "Немо і компанія",
                species: "Риби-клоуни",
                age: "2-3 тижні",
                gender: "Невідомо",
                desc: "Загалом мирні, але можуть проявляти агресію до інших риб, що наближаються до їхньої анемони. Легко адаптуються до життя в акваріумі. Відомі своєю привабливою зовнішністю та поведінкою, що робить їх популярними серед акваріумістів.",
                imageUrl: "alex_rainer-052hzhzi5_E-unsplash.jpg",
                isFeatured: true,
                catSlug: "Риби"
            },
            {
                name: "Боб",
                species: "Павук-стрибунець",
                age: "Невідомо",
                gender: "Невідомо",
                desc: "Павуки стрибунці є хижаками, які полюють на комах та інших безхребетних, пересуваючись і стрибаючи на свою здобич. Дуже активні, проте невибагливі в утриманні.",
                imageUrl: "victor-grabarczyk-tH4NbUG35co-unsplash.jpg",
                isFeatured: true,
                catSlug: "Інші"
            }
        ]
    })
}

seed()
    .catch((e) => {
        console.error(e)
    })
